import React from 'react';

const Terms = () => (
    <div className="terms-wrapper">
        <div className="terms">
            <h1>天津大学求实BBS注册条款</h1>
            <h3>用户有使用真实资料的义务</h3>
            <p>
                用户必须使用个人真实资料注册帐号。便于实名制管理以及用于更好的账号保护与密码找回。
            </p>
            <h3>用户有遵守本站规定的义务</h3>
            <p>
                所有接受本站服务的用户，须表明已阅读并愿意遵守本站现行的各项管理规定。用户应对自己在本站的言行负责，并承担因此而带来的各种站内、站外的相关责任。
            </p>
            <h3>用户发帖及发表言论需规范</h3>
            <p>
                用户不得发布反动言论（如反对国家、反对共产党等），也不得发布虚假信息、影响社会安定等信息（如发布有大地震等虚假信息）。
            </p>
            <h3>用户有维护系统安全的义务</h3>
            <p>
                所有用户都有向站长站务及时反映本站系统程序及管理规定漏洞的义务。不得利用漏洞获取不当利益、扰乱站内秩序、攻击本站。本站如因系统维护而需休站时，会有事先公告。若因不可抗力或意外事件导致休站而造成的一切损失，
                本站不承担任何责任（“不可抗力”是指客观上不能避免或克服的情况；“意外事件”是指主观上无法预见的情况）。
            </p>
            <h3>不可侵犯他人版权</h3>
            <p>
                在本站讨论区发表的原创文章，其版权归发表者个人所有，未经版权所有人许可，任何人不得擅自用于商业目的。用户转载文章应标明作者姓名与出处，转载非网络媒体的文章、图片，应遵守《中华人民共和国著作权法》等相关法
                律法规。对用户个人所造成的著作权侵权及其他侵权行为，本站不承担法律责任。
                本站用户在遵守本总纲及相关规定的前提下拥有使用本站提供的基本上站、发表回复帖子、给他人发信息、加他人为好友的基本权利。
            </p>
            <h3>用户个人资料不受侵犯</h3>
            <p>
                用户的个人资料不受侵犯。本站有责任为用户保密。除非依照相应法律及站规程序，并获得本站站长书面批准，否则本站不接受任何单位或者个人的关于用户个人资料的查询。
                用户在本站内有维护个人隐私、不受人身攻击的权利。用户的私人信件、消息记录等涉及个人隐私的信息在本站范围内受本站保护。用户享有对本站事务的建议权、监督权。
            </p>
            <h3>信息丢失的免责条款</h3>
            <p>
                对于本站用户信息存储失败、删除本人所发布信息、信息按照规定被删除或其他不可抗拒因素导致的信息丢失，本站不承担任何责任。
            </p>
            <h3>用户违法违规的免责条款</h3>
            <p>
                本站合法用户在使用本站资源时触犯中华人民共和国法律、法规的，一切后果由用户自行负责，本站不承担任何责任。
            </p>
        </div>
    </div>
);

export default Terms;
